# GetSymName

## Description
Function GetSymName returns the symbol name of a referenced symbol in a Vectorworks document.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION GetSymName(symHd : HANDLE) : STRING;
```

```python

def vs.GetSymName(symHd):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|symHd|HANDLE|Handle to placed symbol.|

## Version
Availability: from MiniCAD
## Category
* Objects - Symbols